In [ ]:
!pip install openpyxl

In [ ]:
import pandas as pd
file = open('/home/youngmanit/Desktop/Ashish/Tools.xlsx')
excel_data=pd.read_excel('/home/youngmanit/Desktop/Ashish/Tools.xlsx')
columns = ['location_name','type','item_code','name','Category','esimate_value','ok_quantity','damaged_quantity','missing_quantity','meters','serialized','consumable','unserialized']
data = pd.DataFrame(excel_data,columns=columns)
# print(data)
values = [tuple(columns)]
for r1,rows in data.iterrows():
    v1 = []
    for i,v in rows.items():
       v1.append(v)
    values.append(tuple(v1))     
print(values)

In [ ]:
df=pd.DataFrame(data['item_code'])
df1 = df.drop_duplicates()
df2 = df1.count

In [ ]:
df2

In [ ]:
print(data.duplicated(['item_code']).value_counts())

In [2]:
import pandas as pd
import mysql.connector as ms
db = ms.connect(user = 'root',host='localhost',password = 'Root@123')
cur = db.cursor()
# cur.execute('create database youngmen1')
cur.execute('use youngmann')
file = open('/home/youngmanit/Desktop/Python/items.xlsx')
excel_data=pd.read_excel('/home/youngmanit/Desktop/Python/items.xlsx')
columns = ['item_code','name']
data = pd.DataFrame(excel_data,columns=columns)
values = [tuple(columns)]
for r1,rows in data.iterrows():
    v1 = []
    for i,v in rows.items():
       v1.append(v)
    values.append(tuple(v1))

value = str(values[1:])[1:-1]
print(value)
query1 = '''update items set code ='item_code',name = 'name' where id in (90,91,93,94,95,97,272,273,274,375,376,379,390,391,562,563,564,566,578,579,580,581,599,605,651,662,663,664,692,696,697,703,704,706,729,734,737,739,740,741,742,744,746,747,753,795,796,797,798,803,834,835,836,837,838,839,840,841,842,843,844,864,865,866,867,868,869,880,881,882,898,912,947) '''
query = 'insert into details values'+value
cur.execute(query1)
cur.execute(query)
db.commit()
print('done !!!')

(nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan), (nan, nan)

DatabaseError: 1205 (HY000): Lock wait timeout exceeded; try restarting transaction

In [ ]:
import mysql.connector as sql

In [ ]:
db = sql.connect(user ='root',host='localhost',password = 'Root@123')
cur = db.cursor()
cur.execute('create database youngmen1')
cur.execute('use youngmen1')

In [2]:
import pandas as pd
file = open('/home/youngmanit/Desktop/Python/items.xlsx')
excel_data=pd.read_excel('/home/youngmanit/Desktop/Python/items.xlsx')

In [8]:
excel_data

     id
0    90
1    91
2    93
3    94
4    95
..  ...
68  881
69  882
70  898
71  912
72  947

[73 rows x 1 columns]

In [10]:
excel_data=excel_data['id']
excel_data

0      90
1      91
2      93
3      94
4      95
     ...
68    881
69    882
70    898
71    912
72    947
Name: id, Length: 73, dtype: int64

In [25]:
for i in excel_data:
    print(i,end=",")

id,